function binary_arithmetic()
    x = 2;  % 左侧变量。
    y = 3;  % 右侧变量。
    a = 1 + 2;  % 加法：常量。
    b = x + y;  % 加法：变量。
    c = 1 - 2;  % 减法：常量。
    d = x - y;  % 减法：变量。
    e = 1 * 2;  % 矩阵乘法：常量。
    f = x * y;  % 矩阵乘法：变量。
    g = 1 / 2;  % 右除：常量。
    h = x / y;  % 右除：变量。
    i = 1 \ 2;  % 左除：常量。
    j = x \ y;  % 左除：变量。
    k = 1 ^ 2;  % 矩阵幂：常量。
    l = x ^ y;  % 矩阵幂：变量。
    m = 1 .* 2;  % 逐元素乘法：常量。
    n = x .* y;  % 逐元素乘法：变量。
    o = 1 ./ 2;  % 逐元素右除：常量。
    p = x ./ y;  % 逐元素右除：变量。
    q = 1 .\ 2;  % 逐元素左除：常量。
    r = x .\ y;  % 逐元素左除：变量。
    s = 1 .^ 2;  % 逐元素幂：常量。
    t = x .^ y;  % 逐元素幂：变量。
end
