function binary_compare_logic()
x = 2;           % 左侧变量。
y = 3;           % 右侧变量。
a = 1 < 2;       % 小于：常量。
b = x < y;       % 小于：变量。
c = 1 <= 2;      % 小于等于：常量。
d = x <= y;      % 小于等于：变量。
e = 1 > 2;       % 大于：常量。
f = x > y;       % 大于：变量。
g = 1 >= 2;      % 大于等于：常量。
h = x >= y;      % 大于等于：变量。
i = 1 == 2;      % 等于：常量。
j = x == y;      % 等于：变量。
k = 1 ~= 2;      % 不等于：常量。
l = x ~= y;      % 不等于：变量。
m = 1 & 2;       % 双侧逻辑与：常量。
n = x & y;       % 双侧逻辑与：变量。
o = 1 | 2;       % 双侧逻辑或：常量。
p = x | y;       % 双侧逻辑或：变量。
end
